{"pages":[{"title":"Sobre Mim","text":"Oi, eu sou Abraão, um programador e entusiasta de tecnologia de Pindamonhangaba/SP. Sou técnico em informática e estudante de Ciência e Tecnologia no intituto de ciência e tecnologia da UNIFESP. Atualmente estou me dedicando ao desenvolvimento de ferramentas de análise gráfica do mercado financeiro para o Metatrader (indicadores, robôs de negociação, interfaces gráficas…). Também tenho interesse em desenvolvimento web, ciência de dados e inteligência artificial, usando html, css, Javascript, Python, MySql, c++, mql5, mql4, React e Tensorflow. No tempo livre gosto de cozinhar também :) Se quiser falar comigo, você pode me encontrar em: Email abraaol.moreira@outlook.com LinkedinGithubTelegramWhatsappTwitterCookpad Telefone: (12)99611-4106","link":"/pt-br/index.html"},{"title":"Sobre Mim","text":"Oi, eu sou Abraão, um programador e entusiasta de tecnologia de Pindamonhangaba/SP. Sou técnico em informática e estudante de Ciência e Tecnologia no intituto de ciência e tecnologia da UNIFESP. Atualmente estou me dedicando ao desenvolvimento de ferramentas de análise gráfica do mercado financeiro para o Metatrader (indicadores, robôs de negociação, interfaces gráficas…). Também tenho interesse em desenvolvimento web, ciência de dados e inteligência artificial, usando html, css, Javascript, Python, MySql, c++, mql5, mql4, React e Tensorflow. No tempo livre gosto de cozinhar também :) Se quiser falar comigo, você pode me encontrar em: Email abraaol.moreira@outlook.com LinkedinGithubTelegramWhatsappTwitterCookpad Telefone: (12)99611-4106","link":"/pt-br/about/index.html"}],"posts":[{"title":"Contagem regressiva do candle","text":"IntroduçãoPessoas que realizam operações financeira em mercados financeiros muitas vezes utilizam gráficos de preços para visualizar o movimento do mercado e embasar suas decisões, um tipo de gráfico comum para este fim é o gráfico de candles, esse tipo de gráfico gera uma vela com indicações de preços de abertura, fechamento, máxima e mínima em um determinado período de tempo, terminado esse período uma nova vela começa a ser formada. O intuito deste trabalho é criar um cronômetro que indique a quantidade de tempo restante para o fechamento da vela corrente, oferecendo ao trader mais uma ferramenta que facilita a compreensão do gráfico. Repositório MQL5 CodeBaseRepositório Github MetodologiaA função padrão OnCalculate possui entradas padronizadas que possibilitam a obtenção de algumas informações do ativo negociado uma delas é a informação de hora de abertura do candle, utilizando essa informação juntamente com a do período corrente no gráfico e o horário atual a contagem regressiva é calculada seguindo a seguinte equação: HR = HAb - HAt + P HR = Horário instantâneo para a contagem regressiva; HAb = Horário de abertura do candle corrente; HAt = Horário atual (último recebido pelo servidor); P = Período corrente no gráfico em que o indicador está aplicado. Resultados e discuçõesv1.00 Nesta versão a exibição é feita por meio da função Comment, ou seja, o contador aparecerá no canto superior esquerdo do gráfico. Neste tipo de visualização o contador fica discreto e não interfere leitura do gráfico, embora seja de difícil leitura pelo tamanho da fonte padrão do método de exibição utilizado. v1.01 Adicionada exibição utilizando objetos. Foi criado um objeto do tipo label e ancorado no topo superior direito, é possível editar o tamanho da fonte e a cor. Também foi adicionada a possibilidade de escolher entre os tipos de exibição, “comment” ou “Big Number”. v01.02 Adicionada a exibição ainda por meio de objetos, mas agora com um objeto do tipo text, que é criado e movido de forma a seguir o preço de fechamento do último tick. É recomendável utilizar neste modo “On Price” uma fonte menor do que no modo “Big Number”. Nas exibições “Big number” e “On price” o usuário pode escolher a melhor forma de visualização do contador em termos de tamanho, cor e estilo da fonte.","link":"/pt-br/Candle-Countdown/"},{"title":"Site Pessoal","text":"Repositório Github Motivação Como desenvolvedor é importante possuir um website pessoal para publicação de trabalhos e projetos interessantes para que outros desenvolvedores, potenciais empregadores e clientes possam se inspirar ou checar a compatibilidade com um projeto. No mundo de desenvolvimento é muito comum ter dúvidas sobre tecnologias e problemas a serem resolvidos, é sempre um alívio encontrar um post de alguém que já teve o mesmo problema e conseguiu resolver ou uma descrição prática do uso de alguma tecnologia interessante, pra que isso seja possível é necessário que alguém publique esses posts e toda a comunidade tem algo a oferecer nesse campo. A criação de um arquivo pessoal também me atrai muito pensando que ele poderá me ser útil no futuro, e se vai ser útil pra mim pode ser útil pra mais alguém. Ferramentas utilizadas ReactJS O ReactJS ou apenas React é \"uma biblioteca javascript para criar interfaces de usuário\"[1]. Com ela é possível criar o front-end de uma aplicação web de forma simples, pode ser portada para outras plataformas de forma simples por conta do React Native, que utiliza estruturas muito parecidas. Existem diversos componentes que podem ser instalados e utilizados dentro do projeto, como o react-icons e react-gh-pages, que foram utilizados neste projeto. Github Pages O Github possui uma solução bem simples de ser utilizada para a hospedagem gratuita de páginas estáticas [2], a partir de um repositório github existente é possível habilitar a função nas configurações do repositório criar uma página HTML e rapidamente a página estará no ar em um domínio característico pessoal, mas também é possível vincular um domínio próprio. Também é possível criar uma página pessoal de forma equivalente, mas o nome do repositório deve seguir um padrão específico. Metodogia O projeto foi desenvolvido utilizando o Ubuntu 19.10, portanto todos os exemplos de instalação e comandos serão feitos nesse contexto, podendo haver diferenças em outros sistemas. Requisitos Git 1sudo apt install git Caso seja o primeiro acesso será necessário configurar o git: 12git config --global user.name \"abraao\"git config --global user.email abraaol.moreira@outlook.com React O React tem como requisitos o Node e npm, que podem ser baixados no site oficial, é recomendável utilizar a versão LTS atualizada. Utilizando o gerenciador de versões asdf:[5][6] 12345asdf plugin-add nodejs https://github.com/asdf-vm/asdf-nodejs.gitbash ~/.asdf/plugins/nodejs/bin/import-release-team-keyring asdf plugin install nodejs 12.16.1 asdf global nodejs 12.16.1 asdf reshim Para a criação do projeto react instalei o pacote create-react-app: 1npm i -g create-react-app Início do projeto Criei um repositório vazio no github com o meu nome de usuário seguido pelo domínio do github (abraaom.github.io) seguindo as instruções disponíveis no site oficial. [2] Clonei o repositório utilizando o comando: 1git clone https://github.com/AbraaoM/abraaom.github.io.git Criei um projeto react dentro da pasta clonada do github: 1create-react-app . Publicação no gh-pages É necessário instalar no projeto um componente que irá fazer a publicação do projeto no github pages, que não possui suporte nativo ao react. 1npm i react-gh-pages --save-dev Também foi necessário inserir algumas linhas de configuração no arquivo package.json: No início do arquivo: 1\"homepage\": \"http://abraaom.github.io/react-gh-pages\" Na seção scripts: 12\"predeploy\": \"npm run build\",\"deploy\": \"gh-pages -d build\" Para publicar o projeto é necessário apenas o seguinte comando: 1npm run deploy Depois desse passos, já deve existir um novo branch (gh-pages) no repositório github, como se trata de um site pessoal ele ainda não está publicado, porque as configurações devem ser feitas na branch master, basta criar uma nova branch vazia, nomeá-la de \"master\" e fazer um merge entre os dois branchs, em alguns segundos o \"hello world\" padrão do react deve ser publicado e poderá ser acessado pelo domínio abraaom.github.io. Criação do site Para criar o site foram utilizados ícones que pertencem a biblioteca de componentes react-icons, que disponibiliza ícones de diversos pacotes conhecidos de forma simplificada. 1npm i react-icons Para a criação de menus responsivos e aproveitamento de classes utilizei a biblioteca que interliga de forma simplificada o projeto ao Bootstrap 4, react-bootstrap. 1npm install react-bootstrap bootstrap Com este pacote instalado é possível utilizar o bootstrap diretamente dentro do JSX importando classes e utilizando tags, mas também é possível utilizar os componentes presentes na documentação do bootstrap 4. Para fazer as rotas entre as páginas do site utilizei o componente react-router-dom. 1npm i react-router-dom Por meio de um arquivo routes gerencio todas as rotas dentro do projeto. Normalmente de usa a classe BrowserRouter para se fazer esse gerenciamento, entretanto o react-gh-pages não lida bem com está classe, para contornar o problema utilizei a classe HashRouter, que apresenta praticamente o mesmo resultado. Publicação do site Depois de tudo pronto, basta utilizar o comando: 1npm run deploy Ir até o github e fazer o merge da nova branch gh-pages na master, em poucos segundos a página deve ser publicada no domínio abraaom.github.io. Domínio próprio Com o domínio comprado é necessário a configuração de DNS: NOME TIPO VALOR @ A 185.199.108.153 @ A 185.199.109.153 @ A 185.199.110.153 @ A 185.199.111.153 www CNAME abraaom.github.com A forma como esta configuração irá variar a depender do local de compra do domínio, como comprei este na hostgator o procedimento é enviar um chamado por meio do suporte requisitando a configuração seguindo um modelo disponibilizado. Os domínios variarão, mas os IPs são padrão do github pages. Agora dentro do repositório, na branch master, é necessário criar um arquivo nomeado CNAME que contêm o domínio próprio (abraaomoreira.com), se tudo tiver corrido bem e os prazos de alteração do DNS já tiverem sido cumpridos em alguns minutos o site será exibido no novo domínio. Resultados O site foi pensado para ser o mais simples e claro possível, tanto para facilitar e agilizar o desenvolvimento, sem que haja perda na harmonia visual. Apresentação Esta página contêm uma breve apresentação sobre o dono do site com as principais informações de contato e conhecimentos. Mais sobre Esta página apresenta informações mais detalhadas sobre o dono so site, incluindo tragetória acadêmica. Lista de projetos Esta página apresenta uma listagem cronológica estática de páginas de projetos realizados, foi feita uma modelagem de post para cada linguagem de programação facilitando a publicação. Projeto Cada projeto possui uma página detalhando os principais processos utilizados para o desenvolvimento e o seu funcionamento, as páginas possuem estilização comum. Referências [1] Site Oficial React [2] Site oficial Github Pages [3] Getting Started Git [4] Site oficial Node [5] Site oficial asdf [6] Plugin node para asdf [7] Repositório gh-pages [8] React-icons [9] React-bootstrap [10] React-router-dom","link":"/pt-br/Site-Pessoal/"}],"tags":[{"name":"mql5","slug":"mql5","link":"/pt-br/tags/mql5/"},{"name":"react","slug":"react","link":"/pt-br/tags/react/"}],"categories":[{"name":"pt-br","slug":"pt-br","link":"/pt-br/categories/pt-br/"},{"name":"projects","slug":"pt-br/projects","link":"/pt-br/categories/pt-br/projects/"}]}