{"pages":[{"title":"About Me","text":"Hi, I’m a developer and enthusiast of technology based on Pindamonhangaba (Brazil).My current main purpose is in creating tools for stock market graphical analisis with metatrader (mql4 e mql5), developing indicators, bots and graphical interfaces on demand.I’m a student of Science and Tecnology at a brazilian federal university (UNIFESP) and I have interests on web development, data science and artificial inteligence using Javascript, Python, MySql, c++, mql5, mql4, React and Tensorflow. I like to cook on my free time too :) Find me: Email abraaol.moreira@outlook.com LinkedinGithubTelegramWhatsappTwitterCookpad Telefone: (12)99611-4106","link":"/about/index.html"}],"posts":[{"title":"Candle Countdown","text":"IntroductionPeople who perform financial transactions in financial markets often use price charts to visualize the market movement and support their decisions, a common type of chart for this purpose is the candlestick chart, this type of chart generates a candle with price indications of open, close, maximum and minimum price levels in a certain period, after that period a new candle begins to be formed. The purpose of this work is to create a stopwatch that indicates the amount of time remaining for the closing of the current candle, offering to trader another tool that facilitates the understanding of the chart. Repositório MQL5 CodeBaseRepositório Github MethodologyThe default function OnCalculate has inputs standard that enables the obtaining of some asset information negotiated one is the time information of opening the candle using this information along with the current period on the graph and the current time the countdown is calculated following the following equation: HR = HAb - HAt + P HR = Instant time for countdown; HAb = Open time of current candle; HAt = Current time (server time); P = Current chart period where the indicators are applyed. Resultsv1.00 In this version, the display is made using the Comment function, that is, the counter will appear in the upper left corner of the graph. In this type of visualization, the counter is discreet and does not interfere with the reading of the graph, although it is difficult to read due to the standard font size of the display method used. v1.01 Added display using objects. An object of type label was created and anchored in the top right, it is possible to edit the font size and color. The possibility to choose between the types of display, “comment” or “Big Number” has also been added. v01.02 Added the display still through objects, but now with an object of type text, which is created and moved in order to follow the closing price of the last tick. It is recommended to use a smaller font in this “On Price” mode than in the “Big Number” mode. In the displays “Big number” and “On price” the user can choose the best way to view the counter in terms of size, color and style of the font.","link":"/Candle-Countdown/"}],"tags":[{"name":"mql5","slug":"mql5","link":"/tags/mql5/"}],"categories":[{"name":"en","slug":"en","link":"/categories/en/"},{"name":"projects","slug":"en/projects","link":"/categories/en/projects/"}]}